//
//  TestModel.m
//  Runner
//
//  Created by Apple on 2019/12/26.
//  Copyright © 2019 The Chromium Authors. All rights reserved.
//

#import <Foundation/Foundation.h>
#import "TestModel.h"

@implementation TestModel

+(NSArray*) getDemoData{
    NSMutableArray *dataArry=[NSMutableArray array];
    TestModel * m0 =[[TestModel alloc]init];
    m0.name = @"原图";
    m0.arr=@[@0.0f,@0.0f,@0.0f ,@0.0f    ,@0.0f,    @0.0f    ,@0.0f    ,@0.0f ,@0.0f,@0.0f   , @0.0f   ,@0.0f    ,@0.0f   , @0.0f    ,@0.0f    ,@0.0f    ,@0.0f   ,@ 0.0f];
    TestModel * m10086 =[[TestModel alloc]init];
    m10086.name = @"测试脸";
    m10086.arr=@[@0.0f,@0.0f,@0.0f ,@0.0f    ,@0.0f,    @0.0f    ,@0.0f    ,@0.0f ,@0.0f,@0.0f   , @0.0f   ,@0.0f    ,@0.0f   , @0.0f    ,@0.0f    ,@0.0f    ,@0.0f   ,@ 0.0f];
    TestModel * m1 =[[TestModel alloc]init];
    m1.name = @"幼齿脸";
    m1.arr=@[@0.28f,@0.30f,@0.30f ,@0.58f    ,@-0.20f,    @0.22f    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    m1.map=[TestModel getDict1];
    
    
    TestModel * m2 =[[TestModel alloc]init];
    m2.name = @"初恋脸";
    m2.arr=@[ @0.30f,    @0.60f    ,@0.30f,    @0.36f     ,@-0.09f ,@0.46f    ,@0.62f    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.22f    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    m2.map=[TestModel getDict2];
    TestModel * m3 =[[TestModel alloc]init];
    m3.name = @"小鹿脸";
    m3.arr=@[@0.24f,@0.33f,@0.23f,@0.0f,@0.36f,@1.0f,@0.86f,@0.66f,@0.0f,@-0.79f,@0.0f,@0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    m3.map=[TestModel getDict3];
    TestModel * m4 =[[TestModel alloc]init];
    m4.name = @"知性优雅脸";
    m4.arr=@[@0.28f,@0.35f,@0.24f,@0.34f,@0.12f,@0.0f,@0.52f,@0.23f,@0.35f,@0.13f,@0.0f,@0.30f,@0.19f,@0.27f,@0.0f,@0.0f,@1.0f,@1.0f];
    TestModel * m5 =[[TestModel alloc]init];
    m5.name = @"韩系脸";
    m5.arr=@[@0.0f,@0.70f,@0.95f,@0.88f,@0.0f,@0.43f,@0.54f,@0.37f,@0.22f,@0.0f,@0.60f,@0.58f,@0.60f,@0.48f,@0.0f,@0.80f,@1.0f,@1.0f];
    TestModel * m6 =[[TestModel alloc]init];
    m6.name = @"古典脸";
    m6.arr=@[@0.0f,@0.64f,@0.30f,@0.50f,@0.36f,@0.10f,@0.26f,@0.35f,@0.15f,@0.0f,@0.20f,@0.80f,@0.10f,@0.42f,@0.0f,@0.3f,@1.0f,@1.0f];
    TestModel * m7 =[[TestModel alloc]init];
    m7.name = @"抚媚攻气脸";
    m7.arr=@[@0.0f,@0.60f,@0.35f,@0.55f,@0.30f,@0.10f,@0.42f,@0.46f,@0.20f,@0.10f,@0.20f,@0.27f,@0.27f,@0.20f,@0.0f,@0.40f,@0.50f,@0.50f];
    TestModel * m8 =[[TestModel alloc]init];
    m8.name = @"日系脸";
    m8.arr=@[@0.0f,@0.40f,@0.53f,@1.0f,@0.0f,@0.40f,@0.64f,@0.42f,@0.0f,@0.0f,@0.6f,@0.29f,@0.87f,@0.33f,@0.0f,@0.47f,@1.0f,@1.0f];
    
    TestModel * m9 =[[TestModel alloc]init];
    m9.name = @"初恋脸";
    
    m9.arr=@[@0.0f,@0.28f,@0.33f,@0.0f,@0.33f,@-0.50f,@-0.25f,@0.58f,@1.0f,@0.0f,@-0.40f,@-0.30f,@0.48f,@0.42f,@0.45f,@0.0f,@0.55f,@0.60f];
 
    
    TestModel * m10 =[[TestModel alloc]init];
       m10.name = @"小鹿脸";
       m10.arr=@[@0.52f,@0.0f,@0.57f,@0.38f,@0.30f,@0.64f,@0.0f,@-0.62f,@1.0f,@0.31f,@-0.24f,@0.38f,@0.64f,@-0.52f,@0.0f,@0.0f,@1.0f,@1.0f];
    
    TestModel * m11 =[[TestModel alloc]init];
          m11.name = @"优雅脸";
          m11.arr=@[@0.36f,@0.12f,@0.09f,@0.04f,@0.50f,@0.22f,@0.04f,@0.0f,@0.40f,@0.10f,@0.06f,@0.35f,@0.12f,@0.0f,@0.0f,@0.29f,@1.0f,@0.50f];
    
    TestModel * m12 =[[TestModel alloc]init];
             m12.name = @"韩系脸";
             m12.arr=@[@0.56f,@0.34f,@0.30f,@0.52f,@0.31f,@0.16f,@0.08f,@0.12f,@1.0f,@0.16f,@0.0f,@0.21f,@0.38f,@-0.19f,@0.37f,@0.0f,@1.0f,@1.0f];

    TestModel * m13 =[[TestModel alloc]init];
             m13.name = @"古典脸";
             m13.arr=@[@0.50f,@0.0f,@0.0f,@0.14f,@0.22f,@0.31f,@0.0f,@0.0f,@0.50f,@0.21f,@0.0f,@0.07f,@0.36f,@-0.57f,@0.0f,@0.35f,@1.0f,@1.0f];
    
    TestModel * m14 =[[TestModel alloc]init];
                m14.name = @"攻气脸";
                m14.arr=@[@0.67f,@0.20f,@0.0f,@0.24f,@0.0f,@0.25f,@-0.25f,@0.0f,@1.0f,@0.35f,@0.27f,@0.58f,@0.0f,@-0.85f,@-0.28f,@0.20f,@1.0f,@1.0f];

    
    [dataArry addObject:m0];
//    [dataArry addObject:m10086];
    [dataArry addObject:m1];
    [dataArry addObject:m2];
    [dataArry addObject:m3];
    [dataArry addObject:m4];
    [dataArry addObject:m5];
    [dataArry addObject:m6];
    [dataArry addObject:m7];
    [dataArry addObject:m8];
//    [dataArry addObject:m9];
    
//    [dataArry addObject:m10];
//    [dataArry addObject:m11];
//    [dataArry addObject:m12];
//    [dataArry addObject:m13];
//    [dataArry addObject:m14];
    return dataArry;
}



+(NSDictionary*)getDict1{
    NSMutableDictionary* dict=[NSMutableDictionary new];
    NSMutableDictionary* innerDict=[NSMutableDictionary new];
    innerDict[@"桃花眼"]=@[@0.28f,@0.30f,@0.30f ,@0.82f
                        ,@-0.20f,    @0.13f
                        ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict[@"小鹿眼"]=@[@0.28f,@0.30f,@0.30f ,@0.32f
    ,@-0.20f,    @0.26f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict[@"小狗眼"]=@[@0.28f,@0.30f,@0.30f ,@0.26f
    ,@-0.20f,    @0.15f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict[@"细凤眼"]=@[@0.28f,@0.30f,@0.30f ,@0.86f
    ,@-0.20f,    @0.21f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    dict[@"鹅蛋脸"]=innerDict;
    
    NSMutableDictionary* innerDict1=[NSMutableDictionary new];
    innerDict1[@"杏眼"]=@[@0.28f,@0.30f,@0.30f ,@0.62f
    ,@-0.20f,    @0.14f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict1[@"桃花眼"]=@[@0.28f,@0.30f,@0.30f ,@0.54f
    ,@-0.20f,    @0.32f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict1[@"小鹿眼"]=@[@0.28f,@0.30f,@0.30f ,@0.43f
    ,@-0.20f,    @0.12f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict1[@"小狗眼"]=@[@0.28f,@0.30f,@0.30f ,@0.37f
    ,@-0.20f,    @0.21f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict1[@"细凤眼"]=@[@0.28f,@0.30f,@0.30f ,@0.86f
    ,@-0.20f,    @0.32f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    dict[@"长脸"]=innerDict1;
    
    NSMutableDictionary* innerDict2=[NSMutableDictionary new];
    innerDict2[@"杏眼"]=@[@0.28f,@0.30f,@0.30f ,@0.46f
    ,@-0.20f,    @0.32f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict2[@"桃花眼"]=@[@0.28f,@0.30f,@0.30f ,@0.42f
    ,@-0.20f,    @0.12f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict2[@"小鹿眼"]=@[@0.28f,@0.30f,@0.30f ,@0.25f
    ,@-0.20f,    @0.15f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict2[@"小狗眼"]=@[@0.28f,@0.30f,@0.30f ,@0.28f
    ,@-0.20f,    @0.24f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict2[@"细凤眼"]=@[@0.28f,@0.30f,@0.30f ,@0.69f
    ,@-0.20f,    @0.18f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    dict[@"娃娃脸"]=innerDict2;
    
    NSMutableDictionary* innerDict3=[NSMutableDictionary new];
    innerDict3[@"杏眼"]=@[@0.28f,@0.30f,@0.30f ,@0.46f
    ,@-0.20f,    @0.16f
    ,@0.78f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict3[@"桃花眼"]=@[@0.28f,@0.30f,@0.30f ,@0.26f
    ,@-0.20f,    @0.20f
    ,@0.75f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict3[@"小鹿眼"]=@[@0.28f,@0.30f,@0.30f ,@0.39f
    ,@-0.20f,    @0.16f
    ,@0.68f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict3[@"小狗眼"]=@[@0.28f,@0.30f,@0.30f ,@0.27f
    ,@-0.20f,    @0.19f
    ,@0.64f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict3[@"细凤眼"]=@[@0.28f,@0.30f,@0.30f ,@0.76f
    ,@-0.20f,    @0.16f
    ,@0.58f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    dict[@"方脸"]=innerDict3;
    
    NSMutableDictionary* innerDict4=[NSMutableDictionary new];
    innerDict4[@"杏眼"]=@[@0.28f,@0.30f,@0.30f ,@0.57f
    ,@-0.20f,    @0.12f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict4[@"桃花眼"]=@[@0.28f,@0.30f,@0.30f ,@0.42f
    ,@-0.20f,    @0.21f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict4[@"小鹿眼"]=@[@0.28f,@0.30f,@0.30f ,@0.23f
    ,@-0.20f,    @0.18f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict4[@"小狗眼"]=@[@0.28f,@0.30f,@0.30f ,@0.26f
    ,@-0.20f,    @0.18f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict4[@"细凤眼"]=@[@0.28f,@0.30f,@0.30f ,@0.68f
    ,@-0.20f,    @0.13f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    dict[@"瓜子脸"]=innerDict4;
    
    NSMutableDictionary* innerDict5=[NSMutableDictionary new];
    innerDict5[@"杏眼"]=@[@0.28f,@0.30f,@0.30f ,@0.47f
    ,@-0.20f,    @0.56f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict5[@"桃花眼"]=@[@0.28f,@0.30f,@0.30f ,@0.36f
    ,@-0.20f,    @0.67f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict5[@"小鹿眼"]=@[@0.28f,@0.30f,@0.30f ,@0.27f
    ,@-0.20f,    @0.59f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict5[@"小狗眼"]=@[@0.28f,@0.30f,@0.30f ,@0.29f
    ,@-0.20f,    @0.67f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    innerDict5[@"细凤眼"]=@[@0.28f,@0.30f,@0.30f ,@0.72f
    ,@-0.20f,    @0.59f
    ,@0.24f    ,@0.24f ,@-0.12f,@-0.80f   , @0.33f   ,@0.40f    ,@0.31f   , @0.0f    ,@0.17f    ,@0.41f    ,@1.0f   ,@ 1.0f];
    dict[@"晶钻脸"]=innerDict5;
    return dict;
}



+(NSDictionary*)getDict2{
    NSMutableDictionary* dict=[NSMutableDictionary new];
    NSMutableDictionary* innerDict=[NSMutableDictionary new];
    innerDict[@"桃花眼"]=@[ @0.30f,    @0.32f
                         ,@0.62f,
                         @0.56f
                         ,@-0.09f ,@0.51f
                         ,@0.46f
                         ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.11f
                         ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict[@"小鹿眼"]=@[ @0.30f,    @0.13f
    ,@0.27f,
    @0.27f
    ,@-0.09f ,@0.18f
    ,@0.39f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.15f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict[@"小狗眼"]=@[ @0.30f,    @0.26f
    ,@0.27f,
    @0.37f
    ,@-0.09f ,@0.20f
    ,@0.37f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.19f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict[@"细凤眼"]=@[ @0.30f,    @0.29f
    ,@0.24f,
    @0.67f
    ,@-0.09f ,@0.24f
    ,@0.32f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.14f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    dict[@"鹅蛋脸"]=innerDict;
    
    NSMutableDictionary* innerDict1=[NSMutableDictionary new];
    innerDict1[@"杏眼"]=@[ @0.30f,    @0.26f
    ,@0.47f,
    @0.37f
    ,@-0.09f ,@0.24f
    ,@0.43f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.22f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict1[@"桃花眼"]=@[ @0.30f,    @0.29f
    ,@0.43f,
    @0.32f
    ,@-0.09f ,@0.21f
    ,@0.39f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.22f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict1[@"小鹿眼"]=@[ @0.30f,    @0.27f
    ,@0.42f,
    @0.12f
    ,@-0.09f ,@0.19f
    ,@0.37f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.22f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict1[@"小狗眼"]=@[ @0.30f,    @0.23f
    ,@0.39f,
    @0.15f
    ,@-0.09f ,@0.17f
    ,@0.32f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.22f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict1[@"细凤眼"]=@[ @0.30f,    @0.26f
    ,@0.34f,
    @0.59f
    ,@-0.09f ,@0.24f
    ,@0.39f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.22f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    dict[@"长脸"]=innerDict1;
    
    NSMutableDictionary* innerDict2=[NSMutableDictionary new];
    innerDict2[@"杏眼"]=@[ @0.30f,    @0.32f
    ,@0.46f,
    @0.37f
    ,@-0.09f ,@0.21f
    ,@0.32f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.13f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict2[@"桃花眼"]=@[ @0.30f,    @0.37f
    ,@0.47f,
    @0.30f
    ,@-0.09f ,@0.23f
    ,@0.36f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.10f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict2[@"小鹿眼"]=@[ @0.30f,    @0.36f
    ,@0.42f,
    @0.26f
    ,@-0.09f ,@0.19f
    ,@0.33f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.12f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict2[@"小狗眼"]=@[ @0.30f,    @0.39f
    ,@0.49f,
    @0.17f
    ,@-0.09f ,@0.25f
    ,@0.29f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.15f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict2[@"细凤眼"]=@[ @0.30f,    @0.37f
    ,@0.43f,
    @0.56f
    ,@-0.09f ,@0.20f
    ,@0.31f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.12f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    dict[@"娃娃脸"]=innerDict2;
    
    NSMutableDictionary* innerDict3=[NSMutableDictionary new];
    innerDict3[@"杏眼"]=@[ @0.30f,    @0.46f
    ,@0.57f,
    @0.42f
    ,@-0.09f ,@0.36f
    ,@0.56f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.10f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict3[@"桃花眼"]=@[ @0.30f,    @0.48f
    ,@0.53f,
    @0.26f
    ,@-0.09f ,@0.32f
    ,@0.67f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.17f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict3[@"小鹿眼"]=@[ @0.30f,    @0.47f
    ,@0.52f,
    @0.19f
    ,@-0.09f ,@0.37f
    ,@0.59f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.19f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict3[@"小狗眼"]=@[ @0.30f,    @0.50f
    ,@0.54f,
    @0.12f
    ,@-0.09f ,@0.31f
    ,@0.62f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.16f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict3[@"细凤眼"]=@[ @0.30f,    @0.44f
    ,@0.51f,
    @0.56f
    ,@-0.09f ,@0.33f
    ,@0.63f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.14f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    dict[@"方脸"]=innerDict3;
    
    NSMutableDictionary* innerDict4=[NSMutableDictionary new];
    innerDict4[@"杏眼"]=@[ @0.30f,    @0.60f
    ,@0.30f,
    @0.42f
    ,@-0.09f ,@0.12f
    ,@0.62f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.11f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict4[@"桃花眼"]=@[ @0.30f,    @0.60f
    ,@0.30f,
    @0.26f
    ,@-0.09f ,@0.09f
    ,@0.62f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.09f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict4[@"小鹿眼"]=@[ @0.30f,    @0.60f
    ,@0.30f,
    @0.16f
    ,@-0.09f ,@0.11f
    ,@0.62f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.11f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict4[@"小狗眼"]=@[ @0.30f,    @0.60f
    ,@0.30f,
    @0.12f
    ,@-0.09f ,@0.13f
    ,@0.62f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.10f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict4[@"细凤眼"]=@[ @0.30f,    @0.60f
    ,@0.30f,
    @0.56f
    ,@-0.09f ,@0.10f
    ,@0.62f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.09f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    dict[@"瓜子脸"]=innerDict4;
    
    NSMutableDictionary* innerDict5=[NSMutableDictionary new];
    innerDict5[@"杏眼"]=@[ @0.30f,    @0.35f
    ,@0.67f,
    @0.43f
    ,@-0.09f ,@0.62f
    ,@0.46f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.12f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict5[@"桃花眼"]=@[ @0.30f,    @0.36f
    ,@0.59f,
    @0.32f
    ,@-0.09f ,@0.59f
    ,@0.43f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.11f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict5[@"小鹿眼"]=@[ @0.30f,    @0.32f
    ,@0.63f,
    @0.25f
    ,@-0.09f ,@0.52f
    ,@0.39f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.15f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict5[@"小狗眼"]=@[ @0.30f,    @0.29f
    ,@0.59f,
    @0.20f
    ,@-0.09f ,@0.54f
    ,@0.42f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.11f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    innerDict5[@"细凤眼"]=@[ @0.30f,    @0.32f
    ,@0.62f,
    @0.56f
    ,@-0.09f ,@0.53f
    ,@0.47f
    ,@0.37f    ,@-0.26f    ,@-0.20f    ,@0.12f
    ,@0.60f   ,@0.32f    ,@0.0f    ,@0.0f    ,@0.37f    ,@0.50f    ,@1.0f];
    dict[@"晶钻脸"]=innerDict5;
    return dict;
}


+(NSDictionary*)getDict3{
    NSMutableDictionary* dict=[NSMutableDictionary new];
    NSMutableDictionary* innerDict=[NSMutableDictionary new];
    innerDict[@"桃花眼"]=@[@0.24f,@0.23f,
                        @0.07f,
                        @0.26f,
                        @0.36f,@0.10f
                        ,@0.24f
                        ,@0.66f,@0.0f,@-0.79f,@0.21f,
                        @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict[@"小鹿眼"]=@[@0.24f,@0.21f,
    @0.09f,
    @0.17f,
    @0.36f,@0.12f
    ,@0.23f
    ,@0.66f,@0.0f,@-0.79f,@0.24f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict[@"小狗眼"]=@[@0.24f,@0.20f,
    @0.10f,
    @0.12f,
    @0.36f,@0.13f
    ,@0.26f
    ,@0.66f,@0.0f,@-0.79f,@0.23f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict[@"细凤眼"]=@[@0.24f,@0.22f,
    @0.09f,
    @0.42f,
    @0.36f,@0.15f
    ,@0.25f
    ,@0.66f,@0.0f,@-0.79f,@0.20f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    dict[@"鹅蛋脸"]=innerDict;
    
    NSMutableDictionary* innerDict1=[NSMutableDictionary new];
    innerDict1[@"杏眼"]=@[@0.24f,@0.32f,
    @0.09f,
    @0.26f,
    @0.36f,@0.19f
    ,@0.32f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict1[@"桃花眼"]=@[@0.24f,@0.30f,
    @0.23f,
    @0.23f,
    @0.36f,@0.21f
    ,@0.33f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict1[@"小鹿眼"]=@[@0.24f,@0.31f,
    @0.21f,
    @0.17f,
    @0.36f,@0.19f
    ,@0.36f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict1[@"小狗眼"]=@[@0.24f,@0.29f,
    @0.19f,
    @0.12f,
    @0.36f,@0.21f
    ,@0.31f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict1[@"细凤眼"]=@[@0.24f,@0.27f,
    @0.21f,
    @0.36f,
    @0.36f,@0.20f
    ,@0.30f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    dict[@"长脸"]=innerDict1;
    
    NSMutableDictionary* innerDict2=[NSMutableDictionary new];
    innerDict2[@"杏眼"]=@[@0.24f,@0.24f,
    @0.22f,
    @0.26f,
    @0.36f,@0.19f
    ,@0.20f
    ,@0.66f,@0.0f,@-0.79f,@0.20f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict2[@"桃花眼"]=@[@0.24f,@0.26f,
    @0.20f,
    @0.23f,
    @0.36f,@0.19f
    ,@0.19f
    ,@0.66f,@0.0f,@-0.79f,@0.19f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict2[@"小鹿眼"]=@[@0.24f,@0.24f,
    @0.19f,
    @0.17f,
    @0.36f,@0.17f
    ,@0.22f
    ,@0.66f,@0.0f,@-0.79f,@0.20f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict2[@"小狗眼"]=@[@0.24f,@0.22f,
    @0.22f,
    @0.14f,
    @0.36f,@0.20f
    ,@0.23f
    ,@0.66f,@0.0f,@-0.79f,@0.23f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict2[@"细凤眼"]=@[@0.24f,@0.20f,
    @0.21f,
    @0.43f,
    @0.36f,@0.21f
    ,@0.19f
    ,@0.66f,@0.0f,@-0.79f,@0.19f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    dict[@"娃娃脸"]=innerDict2;
    
    NSMutableDictionary* innerDict3=[NSMutableDictionary new];
    innerDict3[@"杏眼"]=@[@0.24f,@0.55f,
    @0.27f,
    @0.23f,
    @0.36f,@0.35f
    ,@0.42f
    ,@0.66f,@0.0f,@-0.79f,@0.26f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict3[@"桃花眼"]=@[@0.24f,@0.52f,
    @0.29f,
    @0.23f,
    @0.36f,@0.33f
    ,@0.46f
    ,@0.66f,@0.0f,@-0.79f,@0.27f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict3[@"小鹿眼"]=@[@0.24f,@0.53f,
    @0.28f,
    @0.17f,
    @0.36f,@0.36f
    ,@0.45f
    ,@0.66f,@0.0f,@-0.79f,@0.29f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict3[@"小狗眼"]=@[@0.24f,@0.57f,
    @0.30f,
    @0.14f,
    @0.36f,@0.32f
    ,@0.42f
    ,@0.66f,@0.0f,@-0.79f,@0.23f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict3[@"细凤眼"]=@[@0.24f,@0.59f,
    @0.31f,
    @0.43f,
    @0.36f,@0.37f
    ,@0.48f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    dict[@"方脸"]=innerDict3;
    
    NSMutableDictionary* innerDict4=[NSMutableDictionary new];
    innerDict4[@"杏眼"]=@[@0.24f,@0.11f,
    @0.07f,
    @0.29f,
    @0.36f,@0.10f
    ,@0.09f
    ,@0.66f,@0.0f,@-0.79f,@0.16f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict4[@"桃花眼"]=@[@0.24f,@0.12f,
    @0.07f,
    @0.23f,
    @0.36f,@0.12f
    ,@0.06f
    ,@0.66f,@0.0f,@-0.79f,@0.19f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict4[@"小鹿眼"]=@[@0.24f,@0.09f,
    @0.07f,
    @0.17f,
    @0.36f,@0.11f
    ,@0.13f
    ,@0.66f,@0.0f,@-0.79f,@0.19f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict4[@"小狗眼"]=@[@0.24f,@0.12f,
    @0.07f,
    @0.12f,
    @0.36f,@0.09f
    ,@0.10f
    ,@0.66f,@0.0f,@-0.79f,@0.16f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict4[@"细凤眼"]=@[@0.24f,@0.13f,
    @0.07f,
    @0.42f,
    @0.36f,@0.07f
    ,@0.12f
    ,@0.66f,@0.0f,@-0.79f,@0.15f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    dict[@"瓜子脸"]=innerDict4;
    
    NSMutableDictionary* innerDict5=[NSMutableDictionary new];
    innerDict5[@"杏眼"]=@[@0.24f,@0.52f,
    @0.46f,
    @0.26f,
    @0.36f,@0.29f
    ,@0.46f
    ,@0.66f,@0.0f,@-0.79f,@0.21f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict5[@"桃花眼"]=@[@0.24f,@0.56f,
    @0.44f,
    @0.17f,
    @0.36f,@0.30f
    ,@0.47f
    ,@0.66f,@0.0f,@-0.79f,@0.22f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict5[@"小鹿眼"]=@[@0.24f,@0.57f,
    @0.40f,
    @0.12f,
    @0.36f,@0.32f
    ,@0.42f
    ,@0.66f,@0.0f,@-0.79f,@0.25f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict5[@"小狗眼"]=@[@0.24f,@0.53f,
    @0.42f,
    @0.12f,
    @0.36f,@0.30f
    ,@0.48f
    ,@0.66f,@0.0f,@-0.79f,@0.20f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    innerDict5[@"细凤眼"]=@[@0.24f,@0.50f,
    @0.39f,
    @0.37f,
    @0.36f,@0.28f
    ,@0.43f
    ,@0.66f,@0.0f,@-0.79f,@0.20f,
    @0.80f,@0.17f,@0.55f,@0.0f,@0.23f,@1.0f,@1.0f];
    dict[@"晶钻脸"]=innerDict5;
    return dict;
}


-(NSDictionary*)getDict4{
    NSMutableDictionary* dict=[NSMutableDictionary new];
    NSMutableDictionary* innerDict=[NSMutableDictionary new];
    innerDict[@"桃花眼"]=@[@0.0f,@0.23f
                        ,@0.07f
                        ,@0.26f
                        ,@0.0f,@0.10f
                        ,@0.24f
                        ,@0.48f,@0.0f,@0.0f,@0.21f
                        ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict[@"小鹿眼"]=@[@0.0f,@0.21f
    ,@0.09f
    ,@0.17f
    ,@0.0f,@0.12f
    ,@0.23f
    ,@0.48f,@0.0f,@0.0f,@0.24f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict[@"小狗眼"]=@[@0.0f,@0.20f
    ,@0.10f
    ,@0.12f
    ,@0.0f,@0.13f
    ,@0.26f
    ,@0.48f,@0.0f,@0.0f,@0.23f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict[@"细凤眼"]=@[@0.0f,@0.22f
    ,@0.09f
    ,@0.42f
    ,@0.0f,@0.15f
    ,@0.25f
    ,@0.48f,@0.0f,@0.0f,@0.20f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    dict[@"鹅蛋脸"]=innerDict;
    
    NSMutableDictionary* innerDict1=[NSMutableDictionary new];
    innerDict1[@"杏眼"]=@[@0.0f,@0.32f
    ,@0.09f
    ,@0.26f
    ,@0.0f,@0.19f
    ,@0.32f
    ,@0.48f,@0.0f,@0.0f,@0.55f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict1[@"桃花眼"]=@[@0.0f,@0.30f
    ,@0.23f
    ,@0.23f
    ,@0.0f,@0.21f
    ,@0.33f
    ,@0.48f,@0.0f,@0.0f,@0.55f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict1[@"小鹿眼"]=@[@0.0f,@0.31f
    ,@0.21f
    ,@0.17f
    ,@0.0f,@0.19f
    ,@0.36f
    ,@0.48f,@0.0f,@0.0f,@0.55f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict1[@"小狗眼"]=@[@0.0f,@0.29f
    ,@0.19f
    ,@0.12f
    ,@0.0f,@0.21f
    ,@0.31f
    ,@0.48f,@0.0f,@0.0f,@0.55f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict1[@"细凤眼"]=@[@0.0f,@0.27f
    ,@0.21f
    ,@0.36f
    ,@0.0f,@0.20f
    ,@0.30f
    ,@0.48f,@0.0f,@0.0f,@0.55f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    dict[@"长脸"]=innerDict1;
    
    NSMutableDictionary* innerDict2=[NSMutableDictionary new];
    innerDict2[@"杏眼"]=@[@0.0f,@0.24f
    ,@0.22f
    ,@0.26f
    ,@0.0f,@0.19f
    ,@0.20f
    ,@0.48f,@0.0f,@0.0f,@0.20f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict2[@"桃花眼"]=@[@0.0f,@0.26f
    ,@0.20f
    ,@0.23f
    ,@0.0f,@0.19f
    ,@0.19f
    ,@0.48f,@0.0f,@0.0f,@0.19f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict2[@"小鹿眼"]=@[@0.0f,@0.24f
    ,@0.19f
    ,@0.17f
    ,@0.0f,@0.17f
    ,@0.22f
    ,@0.48f,@0.0f,@0.0f,@0.20f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict2[@"小狗眼"]=@[@0.0f,@0.22f
    ,@0.22f
    ,@0.14f
    ,@0.0f,@0.20f
    ,@0.23f
    ,@0.48f,@0.0f,@0.0f,@0.23f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict2[@"细凤眼"]=@[@0.0f,@0.20f
    ,@0.21f
    ,@0.43f
    ,@0.0f,@0.21f
    ,@0.19f
    ,@0.48f,@0.0f,@0.0f,@0.19f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    dict[@"娃娃脸"]=innerDict2;
    
    NSMutableDictionary* innerDict3=[NSMutableDictionary new];
    innerDict3[@"杏眼"]=@[@0.0f,@0.55f
    ,@0.27f
    ,@0.23f
    ,@0.0f,@0.35f
    ,@0.42f
    ,@0.48f,@0.0f,@0.0f,@0.26f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict3[@"桃花眼"]=@[@0.0f,@0.52f
    ,@0.29f
    ,@0.23f
    ,@0.0f,@0.33f
    ,@0.46f
    ,@0.48f,@0.0f,@0.0f,@0.27f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict3[@"小鹿眼"]=@[@0.0f,@0.53f
    ,@0.28f
    ,@0.17f
    ,@0.0f,@0.36f
    ,@0.45f
    ,@0.48f,@0.0f,@0.0f,@0.29f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict3[@"小狗眼"]=@[@0.0f,@0.57f
    ,@0.30f
    ,@0.14f
    ,@0.0f,@0.32f
    ,@0.42f
    ,@0.48f,@0.0f,@0.0f,@0.23f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict3[@"细凤眼"]=@[@0.0f,@0.59f
    ,@0.31f
    ,@0.43f
    ,@0.0f,@0.37f
    ,@0.48f
    ,@0.48f,@0.0f,@0.0f,@0.21f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    dict[@"方脸"]=innerDict3;
    
    NSMutableDictionary* innerDict4=[NSMutableDictionary new];
    innerDict4[@"杏眼"]=@[@0.0f,@0.11f
    ,@0.23f
    ,@0.29f
    ,@0.0f,@0.10f
    ,@0.09f
    ,@0.48f,@0.0f,@0.0f,@0.16f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict4[@"桃花眼"]=@[@0.0f,@0.12f
    ,@0.23f
    ,@0.23f
    ,@0.0f,@0.12f
    ,@0.06f
    ,@0.48f,@0.0f,@0.0f,@0.19f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict4[@"小鹿眼"]=@[@0.0f,@0.09f
    ,@0.23f
    ,@0.17f
    ,@0.0f,@0.11f
    ,@0.13f
    ,@0.48f,@0.0f,@0.0f,@0.19f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict4[@"小狗眼"]=@[@0.0f,@0.12f
    ,@0.23f
    ,@0.12f
    ,@0.0f,@0.09f
    ,@0.10f
    ,@0.48f,@0.0f,@0.0f,@0.16f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict4[@"细凤眼"]=@[@0.0f,@0.13f
    ,@0.23f
    ,@0.42f
    ,@0.0f,@0.07f
    ,@0.12f
    ,@0.48f,@0.0f,@0.0f,@0.15f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    dict[@"瓜子脸"]=innerDict4;
    
    NSMutableDictionary* innerDict5=[NSMutableDictionary new];
    innerDict5[@"杏眼"]=@[@0.0f,@0.52f
    ,@0.46f
    ,@0.26f
    ,@0.0f,@0.29f
    ,@0.46f
    ,@0.48f,@0.0f,@0.0f,@0.21f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict5[@"桃花眼"]=@[@0.0f,@0.56f
    ,@0.44f
    ,@0.17f
    ,@0.0f,@0.30f
    ,@0.47f
    ,@0.48f,@0.0f,@0.0f,@0.22f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict5[@"小鹿眼"]=@[@0.0f,@0.57f
    ,@0.40f
    ,@0.12f
    ,@0.0f,@0.32f
    ,@0.42f
    ,@0.48f,@0.0f,@0.0f,@0.25f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict5[@"小狗眼"]=@[@0.0f,@0.53f
    ,@0.42f
    ,@0.12f
    ,@0.0f,@0.30f
    ,@0.48f
    ,@0.48f,@0.0f,@0.0f,@0.20f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    innerDict5[@"细凤眼"]=@[@0.0f,@0.50f
    ,@0.39f
    ,@0.37f
    ,@0.0f,@0.28f
    ,@0.43f
    ,@0.48f,@0.0f,@0.0f,@0.21f
    ,@0.80f,@0.3f,@0.19f,@0.0f,@0.75f,@1.0f,@1.0f];
    dict[@"晶钻脸"]=innerDict5;
    return dict;
}
@end
